/*************************************************************************************
 * Description  : 例题1.写程序实现一个函数printN，使得传入一个正整数为N的参数后，能顺序打印从1到N的全部正整数.
 * Author       : star-air
 * Date         : 2021-05-06 19:29:40
 * LastEditTime : 2022-11-29 23:13:45
 * LastEditors  : star-air
 * Reference    : 
 *************************************************************************************/


#include <stdio.h>

/*************************************************************************************
 * description: 递归
 * param {int} N
 *************************************************************************************/
void PrintN1(int N)
{
    if(N)
    {
        PrintN1(N-1);
        printf("%d \n",N);

    }
}

/*************************************************************************************
 * description: 迭代
 * param {int} N
 *************************************************************************************/
void PrintN2(int N)
{
    for(int i=0;i<N;i++)
    {
        printf("%d \n",i);
    }

}

int main(int argc, char const *argv[])
{
    /* code */
    PrintN1(10);
    PrintN2(10);
    return 0;
}
